V4-project/V4-ports/esp32c6/examples/v4-repl-demo/sdkconfig.defaults
# V4 REPL Demo - ESP32-C6 SDK Configuration

# Target configuration
CONFIG_IDF_TARGET="esp32c6"

# Serial console configuration
CONFIG_ESPTOOLPY_BAUD_115200B=y
CONFIG_ESPTOOLPY_BAUD=115200
CONFIG_ESPTOOLPY_MONITOR_BAUD_115200B=y
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200

# USB Serial/JTAG Console (for ESP32-C6)
# Enable USB Serial/JTAG as primary console for stdin/stdout
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# USB Serial/JTAG secondary console for logging during init
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

# FreeRTOS configuration
CONFIG_FREERTOS_HZ=1000

# ESP System configuration
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_ESP_INT_WDT=n

# Compiler options
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

# Bootloader log level
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y
CONFIG_BOOTLOADER_LOG_LEVEL=3

# Application configuration
# Optimized for V4-front with reduced MAX_WORDS/MAX_CONTROL_DEPTH
# Stack usage reduced from 22KB to ~7KB with ESP32-specific settings
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Increase stack size for REPL
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=4096
